# find the pandas version

In [2]:
import pandas as pd
print(pd.__version__)

1.3.5

# convert list to series

In [8]:

mark=[40,20,56,21,98]
mark_series=pd.Series(mark)
print(mark_series)

0    40
1    20
2    56
3    21
4    98
dtype: int64

# convert list to series with specified index

In [9]:
score=[100,25,7,200]
score_index=pd.Series(score,index=[2,3,4,1])
print(score_index)

2    100
3     25
4      7
1    200
dtype: int64

# generate date for the given range(MM-DD-YYYY)

In [10]:
dr=pd.date_range(start='04-01-2022',end='04-20-2022')
print(dr)

DatetimeIndex(['2022-04-01', '2022-04-02', '2022-04-03', '2022-04-04',
               '2022-04-05', '2022-04-06', '2022-04-07', '2022-04-08',
               '2022-04-09', '2022-04-10', '2022-04-11', '2022-04-12',
               '2022-04-13', '2022-04-14', '2022-04-15', '2022-04-16',
               '2022-04-17', '2022-04-18', '2022-04-19', '2022-04-20'],
              dtype='datetime64[ns]', freq='D')

# dic to dataframe

In [13]:
fruits={'Name':['Apple','orange','grapes'],
         'Quantity':[2,8,9],
         'Price':[300,700,900]
       
       }
df=pd.DataFrame(fruits)
df

     Name  Quantity  Price
0   Apple         2    300
1  orange         8    700
2  grapes         9    900

# List to Dataframe

In [15]:
myList=[[1001,'David',98],[1005,'Jane',98],[1008,'Venila',75]]
df=pd.DataFrame(myList,columns=['Admission_no','Name','English_mark'])
df

   Admission_no    Name  English_mark
0          1001   David            98
1          1005    Jane            98
2          1008  Venila            75